{"config": [{"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "epsilon": 0.001, "batch_input_shape": [null, 66, 200, 3], "axis": 1, "name": "batchnormalization_1", "momentum": 0.99, "beta_regularizer": null, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "nb_row": 5, "b_constraint": null, "subsample": [2, 2], "nb_col": 5, "init": "glorot_uniform", "nb_filter": 24, "trainable": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "bias": true, "name": "conv1", "dim_ordering": "tf", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "nb_row": 5, "b_constraint": null, "subsample": [2, 2], "nb_col": 5, "init": "glorot_uniform", "nb_filter": 36, "trainable": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "bias": true, "name": "conv2", "dim_ordering": "tf", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "nb_row": 5, "b_constraint": null, "subsample": [2, 2], "nb_col": 5, "init": "glorot_uniform", "nb_filter": 48, "trainable": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "bias": true, "name": "conv3", "dim_ordering": "tf", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "nb_row": 3, "b_constraint": null, "subsample": [1, 1], "nb_col": 3, "init": "glorot_uniform", "nb_filter": 64, "trainable": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "bias": true, "name": "conv4", "dim_ordering": "tf", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_4"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "activity_regularizer": null, "nb_row": 3, "b_constraint": null, "subsample": [1, 1], "nb_col": 3, "init": "glorot_uniform", "nb_filter": 64, "trainable": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "bias": true, "name": "conv5", "dim_ordering": "tf", "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 1164, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "b_regularizer": null, "bias": true, "name": "dense_1", "input_dim": 1152, "activation": "linear"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 100, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "b_regularizer": null, "bias": true, "name": "dense_2", "input_dim": 1164, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 50, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "b_regularizer": null, "bias": true, "name": "dense_3", "input_dim": 100, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 10, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "b_regularizer": null, "bias": true, "name": "dense_4", "input_dim": 50, "activation": "linear"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 1, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "b_regularizer": null, "bias": true, "name": "dense_5", "input_dim": 10, "activation": "linear"}}], "class_name": "Sequential", "keras_version": "1.2.1"}