{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "BatchNormalization", "config": {"batch_input_shape": [null, 66, 200, 3], "name": "batchnormalization_1", "axis": 1, "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "trainable": true, "mode": 0, "input_dtype": "float32", "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "subsample": [1, 1], "nb_row": 1, "W_constraint": null, "b_regularizer": null, "nb_filter": 3, "border_mode": "same", "activation": "linear", "trainable": true, "name": "color_conv", "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 1, "bias": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "subsample": [4, 4], "nb_row": 8, "W_constraint": null, "b_regularizer": null, "nb_filter": 16, "border_mode": "same", "activation": "elu", "trainable": true, "name": "convolution2d_1", "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 8, "bias": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "subsample": [2, 2], "nb_row": 5, "W_constraint": null, "b_regularizer": null, "nb_filter": 32, "border_mode": "same", "activation": "elu", "trainable": true, "name": "convolution2d_2", "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "bias": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "subsample": [2, 2], "nb_row": 5, "W_constraint": null, "b_regularizer": null, "nb_filter": 64, "border_mode": "same", "activation": "linear", "trainable": true, "name": "convolution2d_3", "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 5, "bias": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_1", "b_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "input_dim": 4160, "b_constraint": null, "W_regularizer": null, "output_dim": 512, "bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "name": "dense_2", "b_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "input_dim": 512, "b_constraint": null, "W_regularizer": null, "output_dim": 1, "bias": true, "activity_regularizer": null}}]}