{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "epsilon": 0.001, "axis": 1, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_1", "momentum": 0.99, "input_dtype": "float32", "mode": 0, "batch_input_shape": [null, 66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "nb_row": 1, "b_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "name": "color_conv", "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_filter": 3, "b_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "nb_row": 8, "b_regularizer": null, "nb_col": 8, "init": "glorot_uniform", "name": "convolution2d_1", "subsample": [4, 4], "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_filter": 16, "b_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "activation": "elu"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "nb_row": 5, "b_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_2", "subsample": [2, 2], "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_filter": 32, "b_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "activation": "elu"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "nb_row": 5, "b_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_3", "subsample": [2, 2], "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_filter": 64, "b_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "activity_regularizer": null, "output_dim": 512, "bias": true, "b_constraint": null, "trainable": true, "input_dim": 4160, "W_constraint": null, "W_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "activity_regularizer": null, "output_dim": 1, "bias": true, "b_constraint": null, "trainable": true, "input_dim": 512, "W_constraint": null, "W_regularizer": null, "activation": "linear"}}]}