{"config": [{"config": {"input_dtype": "float32", "name": "batchnormalization_1", "mode": 0, "batch_input_shape": [null, 66, 200, 3], "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": 1, "beta_regularizer": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"W_regularizer": null, "nb_row": 1, "init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "activation": "linear", "nb_filter": 3, "trainable": true, "W_constraint": null, "name": "color_conv", "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_col": 1}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "nb_row": 8, "init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "activation": "elu", "nb_filter": 16, "trainable": true, "W_constraint": null, "name": "convolution2d_1", "b_constraint": null, "subsample": [4, 4], "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_col": 8}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "activation": "elu", "nb_filter": 32, "trainable": true, "W_constraint": null, "name": "convolution2d_2", "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "activation": "linear", "nb_filter": 64, "trainable": true, "W_constraint": null, "name": "convolution2d_3", "b_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": 4160, "W_constraint": null, "output_dim": 512, "name": "dense_1", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": 512, "W_constraint": null, "output_dim": 1, "name": "dense_2", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}