{"config": [{"config": {"name": "zeropadding2d_1", "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "trainable": true, "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"bias": true, "name": "convolution2d_1", "init": "glorot_uniform", "dim_ordering": "tf", "activation": "elu", "b_regularizer": null, "nb_filter": 32, "nb_col": 3, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_constraint": null, "trainable": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_2", "trainable": true, "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"bias": true, "name": "convolution2d_2", "init": "glorot_uniform", "dim_ordering": "tf", "activation": "elu", "b_regularizer": null, "nb_filter": 32, "nb_col": 3, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_constraint": null, "trainable": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_3", "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "trainable": true, "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"bias": true, "name": "convolution2d_3", "init": "glorot_uniform", "dim_ordering": "tf", "activation": "elu", "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_constraint": null, "trainable": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_4", "trainable": true, "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"bias": true, "name": "convolution2d_4", "init": "glorot_uniform", "dim_ordering": "tf", "activation": "elu", "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_constraint": null, "trainable": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "zeropadding2d_5", "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "trainable": true, "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"bias": true, "name": "convolution2d_5", "init": "glorot_uniform", "dim_ordering": "tf", "activation": "elu", "b_regularizer": null, "nb_filter": 128, "nb_col": 3, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_constraint": null, "trainable": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_6", "trainable": true, "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"bias": true, "name": "convolution2d_6", "init": "glorot_uniform", "dim_ordering": "tf", "activation": "elu", "b_regularizer": null, "nb_filter": 128, "nb_col": 3, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_constraint": null, "trainable": true, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_3", "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "input_dtype": "float32", "batch_input_shape": [null, 3, 200, 66], "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "name": "dense_1", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 256, "input_dim": 25600, "trainable": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "elu", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_2", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 64, "input_dim": 256, "trainable": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "elu", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "dense_3", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 16, "input_dim": 64, "trainable": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "elu", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"bias": true, "name": "dense_4", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1, "input_dim": 16, "trainable": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}