{"config": [{"config": {"gamma_regularizer": null, "mode": 0, "batch_input_shape": [null, 66, 200, 3], "name": "batchnormalization_1", "momentum": 0.99, "epsilon": 0.001, "input_dtype": "float32", "trainable": true, "beta_regularizer": null, "axis": 1}, "class_name": "BatchNormalization"}, {"config": {"b_constraint": null, "W_constraint": null, "activity_regularizer": null, "name": "color_conv", "trainable": true, "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "activation": "linear", "nb_col": 1, "nb_filter": 3, "bias": true, "border_mode": "same", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_1", "trainable": true, "nb_row": 8, "b_regularizer": null, "W_regularizer": null, "subsample": [4, 4], "init": "glorot_uniform", "activation": "elu", "nb_col": 8, "nb_filter": 16, "bias": true, "border_mode": "same", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_2", "trainable": true, "nb_row": 5, "b_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "activation": "elu", "nb_col": 5, "nb_filter": 32, "bias": true, "border_mode": "same", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"b_constraint": null, "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_3", "trainable": true, "nb_row": 5, "b_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "activation": "linear", "nb_col": 5, "nb_filter": 64, "bias": true, "border_mode": "same", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "W_constraint": null, "activity_regularizer": null, "input_dim": 4160, "name": "dense_1", "trainable": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 512, "init": "glorot_uniform", "activation": "linear", "bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "W_constraint": null, "activity_regularizer": null, "input_dim": 512, "name": "dense_2", "trainable": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "bias": true}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}